# Misc variables
default ap = 3 # Action points
default sex = False # false - Female, true - Male
default pn = "Jane Doe" # Player name
image black = "#000"

# Characters
define me = Character(pn, color="#85aafa")
define krista = Character('Криста', color="#FA8072")
define timur = Character('Тимур', color="#191970")
define zhenya_f = Character('Женя', color="#D3D3D3")
define zhenya_m = Character('Женя', color="#a09d9d")

# Side characters
define mom = Character('Мама', color="#ffff80")
define nast = Character("Наставник", color="#ff8800") # I'll add the real color later
define sec = Character('Охрана', color="#040c36")
define tutor = Character('Тьютор', color="#ab23c4")

# Character relationship levels
default rl_krista = 0
default rl_timur = 0
default rl_zhenya_f = 0
default rl_zhenya_m = 0

# Transforms
transform half_size:
    zoom 0.5

$ flash = Fade(.25, 0, .75, color="#fff")

# Start
label start:

    menu:
        "Выберите пол персонажа для лучшего погружения:"

        "Женский":
            $ sex = False
        
        "Мужской":
            $ sex = True
    
    "Как зовут вашего персонажа?"
    $ pn = renpy.input("Введите имя").strip()
    if sex:
        jump prologue_m
    else:
        jump prologue_f

label prologue_f:
    scene bg room at half_size

    """Я открыла глаза и уставилась в потолок.
    {p=0.5}В дальнем левом углу посеревший и свалявшийся от времени комок паутины.
    {p=0.5}{i}Если спросить прямо сейчас, какой из них мне симпатичен больше других, я бы сказала..{/i}"""

    show mom at half_size 
    mom "ПОДЪЁМ!"
    "В проёме грубо распахнутой двери стояла мама, кажется, пытавшаяся разбудить меня уже не в первый раз."
    mom "[pn], ты время вообще видела? Четвёртый час пошёл, так ведь всю жизнь проспишь."
    me "..Я бы сказала вон тот."
    "Буркнула я, ощутив красной вспышкой сквозь закрытые веки солнечный свет, и накрылась одеялом с головой."
    scene bg black at half_size
    with dissolve
    # add sound
    "Определив, что мама покинула комнату, с горестным вздохом захлопнув дверь, я достала из-под подушки нагретый мобильник." with vpunch
    me "11%, опять не поставила на ночь на зарядку."
    "Недовольно засопев, но не отложив телефон я решила, что маленький процент - не повод лишать себя удовольствия пролистать ленту рекомендаций в тик ток."
    "..."
    show phone tt at half_size
    "Не пропустив ни одного сюжета о семейных разборках сомнительного уровня достоверности  я с досадой смотрю на прощальный мерцающий экран, который сообщает о полной разрядке устройства."
    me "Да ладно, блин, я не дослушала.."
    "Приходится приподняться на локтях чтоб дотянуться до наручных часов, хотя даётся мне это не без труда."
    scene bg room at half_size
    with dissolve
    "17:41"
    "{i}Хороший день начинается с хорошего завтрака.{/i}"
    "..."
    scene bg kitchen at half_size
    show mom angry at half_size
    with dissolve
    "Выслушивая лекцию о бесполезности собственного существования каждый день, как ни странно, начинаешь обижаться на человека, который эту лекцию читает."
    me ".. И плевать я хотела на твою подругу и на её бесценную отличницу дочку. Я - твоя дочь, уж извини, но какая есть!"
    "Последнюю фразу заглушил грохот двери моей комнаты, который, наверное, слышали соседи ещё на пару этажей вниз." with vpunch # add sound
    scene bg pc sun at half_size
    with dissolve
    "Подавляя неясные тяжёлые мысли каким-то вирусным навязчивым хитом я натягиваю наушники и щёлкаю кнопкой на блоке питания родного пк."
    "Выпрямившись на стуле я тут же недовольно сощурилась."
    me "Задолбало это солнце!"
    "Взбешённая очередным лучиком света, проскользнувшим в узкую щель непроницаемых штор и лизнувшим моё лицо, я рывком стягиваю две их части."
    # add sound
    scene bg pc message at half_size
    with dissolve
    "Теперь в комнате кромешная тьма. {i}Наконец.{/i}"
    "\"18:30\". Открываю браузер с намерением глянуть какой-нибудь остросюжетный сериальчик под чипсы и остатки чёрного чая в кружке, которая стоит здесь уже.. {w=0.1}Не так важно."
    "На главной странице браузера меня встречает яркий малиновый закат, а я задумываюсь: {i}Когда я видела такой в последний раз? А если вспомнить, я вообще в последнее время видела небо?{/i}"
    "Любопытная рука тянется с намерением сдвинуть занавеску, но с резким \"блим\" на компьютер приходит уведомление от одного из моих интернет-друзей, которому невозможно не ответить." # add sound
    "..."
    "Перекинувшись парой фраз со старым знакомым я бодро перевожу курсор на крест и кликаю на иконку любимой игры.."
    scene bg pc game at half_size
    "..."
    "Время пролетает незаметно. когда веко на левом глазу начинает подергиваться от осознания скудности ума моих товарищей по команде я решаю свернуть вкладку. Глаза слипаются, я подавляю зевок, но спать, конечно, еще не хочется."
    scene bg pc at half_size
    "..."
    scene bg pc thread at half_size
    with dissolve
    "20 минут спустя я лежу на протянутой по столу руке, с приоткрытым ртом и прикрытыми веками, скролля ветку комментариев под постом к заинтересовавшему меня треду.."
    "user_865909668: очевидно что это «маджента». аытор, прикупи мб монитор нормальный а не калькулчтор"
    "kotikii.wau: Какая маджента?? Это классический «закат в Майами». Учите колористику, прежде чем писать че попало."
    "dimonkpasavva21: это если че вообще фильтр «насыщенность» на 100 проц. в рж такого неба не бывает, расходимся"
    "user_865909668: @dimonkpasavva21, выиди на улицу хоть раз, эксперт диваный. бывант и не такое."
    "Pankihoi097: Ребят вот вы серьезно? 228 коммов из-за оттенка? Это СИНИЙ в тенях всё решает. Без синего этот ваш малиновый — тупо грязное пятно."
    "pe4enkonzm: @Pankihoi097, синий там только в твоей голове. а это холодный розовый"
    "user_865909668: @pe4enkonzm, боже мой ты глаза прлтри. здесь глубккий винный градиент."

    menu:
        me "Ну не знаю, мне кажется.."

        "Это синий":
            pass
        "Это фуксия":
            pass
    
    "s0nechkaTOPluv: Боже, какая разница... красиво же."
    "dimonkpasavva21: @s0nechkaTOPluv, разница в том что люди деградируют и не видят ниче вообще. это ФУКСИЯ"
    "Anonimguest: Всё это — просто цифры. RGB: 255, 0, 255. О чем тут спорить? Математика не врет."
    "user_865909668: @Anonimguest, математтка так тт не учитывает восприятие. для кого то это цвет надежды, а для кого то цвет крови."
    "kotikii.wau: О, философы в чате. Сейчас еще про смысл жизни затирать начнут…"

    "Я вглядываюсь в своё отсутствующее выражение лица в отражении монитора..."
    scene bg pc ad at half_size
    "... И жмурюсь от рези в глазах! На экран спасительной тёмной темы вырывается стерильно белая реклама с тошнотворно-оранжевым логотипом в виде Грифона. «МВЕК - твой второй дом»"
    "С губ непроизвольно срывается злобный смешок"
    me "Да, в моем доме тоже пытаются отжать остатки ментального здоровья."
    "Пальцы резво соскальзывают с колёсика мыши к левой кнопке и, возможно, чрезмерно резко щёлкают на крестик."
    scene bg pc at half_size
    "Я перевожу взгляд в нижний угол экрана.. 2:51, 25.08."
    "Снова бегло читаю комментарии под постом, общей суммы слов которых хватило бы на тонкую книжонку.."
    me "Вот людям заняться нечем."
    "Придя к выводу о том, что этих рассуждений мне недостаточно для вынесения своего вердикта, я решаю довериться искусственному интеллекту и набираю текст, не глядя на клавиатуру: \"алиса какой цвет лучше фуксия ил..\""
    scene bg pc ad at half_size
    me "Да что за чёрт!"
    "На этот раз я даже не успеваю отклонить назойливое приглашение \"домой\", когда в лс приходит сообщение от человека, подписанного единственным кричащим словом \"Наставник\"."
    nast "Интересный выбор стратегии"
    menu:
        "Пару секунд я размышляю, кинуть интригующего человека в игнор или попробовать ответить.."

        "Проигнорировать его.":
            me "Ну и бред."
            "Я заканчиваю печатать свой запрос, по-прежнему не отводя глаз от экрана, когда приходит второе уведомление.."
            nast "Но, пожалуй, не самая эффективная."
            "На этот раз я, не задумываясь, гневно набираю быстрый ответ:"
            me "че ты несешь? подарки я не продаю, микрозайм мне не нужен, фотку свою не пришлю, ищи кого-то другого"

        "Ответить ему.":
            "Я хмуро и медленно моргаю, не представляя что ему от меня нужно, и все же решаюсь набрать ответ:"
            me "чего? какие стратегии"
            nast "Он ждёт, что ты выберешь нужную стратегию"
            "Измождённое сознание мрачнеет. Неудивительно, если посчитать, сколько уже я здесь сижу."
            "{i}Чёрт знает кто этот \"Он\", и он кого-то ждёт, замечательно, а я тут..{/i}"

    nast "Он ждёт не \"кого-то\", он ждёт того, кто устал быть никем"
    "Моя правая бровь изогнулась, кажется, почти под прямым углом."
    me "Боже, сколько пафоса. Не знала что коучи теперь и в 3 ночи написывают."
    "Отмахнувшись от ещё более откровенного бреда я кликаю на спасительные 3 точки и блокирую собеседника, который, совершенно точно, не в себе."
    me "Новая разводная схема что-ли?"
    "Я подавляю зевок и невольно прикрываю опухшие веки..."
    "Шорх!" # add sound
    # Add a white screen transition or something
    "Моё тело не собирается функционировать ни под каким предлогом, но вдруг вокруг становится подозрительно светло."
    "Лениво размыкается веко правого глаза и тут же схлопывается в панике от вспышки ярко-рыжего неба в паре метров перед собой."
    me "Мама? Ну и зачем она.."
    "Сил хватает только на то чтоб натянуть капюшон на лицо."
    scene bg black at half_size
    "..."
    scene bg lobby:
        half_size
        blur 40
    show sec angry:
        half_size
        blur 40
    with flash
    "???" "Ну ты там издеваешься что ли!?"
    "Густой нечленораздельный голос в голове застаёт меня врасплох"
    me "Че-его?"
    "На заданный, казалось, шёпотом вопрос прилетает быстрый и раздражённый ответ."
    "???" "Да ничего, если студенческий забыла отойди и позвони тьютору, а не стой тут как.."
    scene bg lobby at half_size
    show sec angry at half_size
    "Конец предложения тонет в звонком окрике немолодой женщины, видимо, предназначающемся для меня."
    sec "Вон у тебя студенческий, я отсюда в кармане вижу!"
    me "СТУДЕНЧЕСКИЙ?"
    "Я бросаю судорожный взгляд поочерёдно на каждый из карманов своих джинс и обнаруживаю в левом... {w=0.5}{cps=*0.75}Торчащий краешек синей корочки.{/cps}"
    jump day1_f

label day1_f:
    scene bg lobby at half_size
    show sec angry at half_size
    with dissolve
    "Мне хватает осознания того, что я сейчас в том месте, в которое не приходила по доброй воле, так что я, не доставая никакой мифический студенческий, разворачиваюсь и пытаюсь протиснуться сквозь плотную толпу.. {w=0.2}{cps=*0.9}студентов??{/cps}"
    hide sec angry with dissolve
    "{i}Да что это за фигня?! я вроде в детстве не лунатила, так почему в 16 лет..{/i}"
    "Я делаю успехи, истерично распихивая локтями молодых людей, но меня грубо выталкивают назад и по инерции я разворачиваюсь.."
    show sec angry at half_size
    sec "Так.."
    "Уставившись округлившимися глазами на женщину в чёрной робе с надписью \"охрана\",  с которой оказалась лицом к лицу, я теряюсь.."
    me "Эм.. я тут.."
    sec "Что за цирк?"
    "Не дождавшись от меня ни вразумительного ответа, ни активных действий, она выхватывает загадочный документ из моего кармана и победно произносит, раскрывая и жадно и изучая каждую строчку.."
    sec "Если ещё раз здесь представление устроишь я тебя вообще не пропущу, понятно?"
    "Я подкатываю глаза в ответ на эту возмутительную фразу и даже не успеваю сказать, что они вообще-то, ошиблись студентом, как сзади меня бесцеремонно вдавливают в турникет и я вваливаюсь в просторный ярко выглядящий коридор."
    scene bg hall1 at half_size
    with dissolve
    "Я прижимаюсь спиной к стене в попытке найти опору, глубоко вдыхая воздух с запахом еды, чьих-то цветочных духов и чего-то ещё неуловимо приятного.."
    "{i}Так, ладно. Когда-то же кончится эта человеческая лавина? Под шумок пролезу и обратно.{/i}"
    "Обратив внимание на интерьер коридора я, к удивлению, вижу не постсоветскую сказку, а стильно оформленное помещение. Под ногами лежит не вековой растрескавшийся бетон, а крупная светлая плитка, намытая до блеска. На стене - фотографии счастливых студентов в компании молодых преподавателей."
    "Чем дольше я разглядываю эти стены, тем спокойнее на душе мне становится, ведь приходит очевидное осознание того, что это просто сон."
    "{i}Один из самых кошмарных снов, в котором мне придётся заниматься разными невероятно весёлыми активностями и прочей ересью, обыденной для порядочного студента.{/i}"
    "Когда глаза начинают болеть от количества прочитанных за раз слов, я впервые слышу среди несвязного шума (характерного скорее для имитирования диалогов массовкой в каких-нибудь фильмах) вполне живое обсуждение.."
    "??? 1" "..Ага, и надеюсь к обеду всю пиццу не сожрали, как обычно."
    "??? 2" "Ну ты надейся главное. Я выхожу вчера из кабинета, она с лекции пораньше отпустила, спускаюсь в столовую, а там очередь не то что до гардероба, прям до лестницы! Так что на большой перерыв лучше..."
    "{i}Вот прям до лестницы? Неа, так в столовых не кормят.{/i}"
    "Я с интересом провожаю взглядом девочку, которая продолжает отчаянно жестикулировать подруге, наверное подводя к развязке своей истории."
    "Ещё минуту назад я не представляла чем здесь можно заняться, но после разговора о еде вдруг почувствовала совсем рядом аромат кофе и тёплых булочек."
    "{i}Ну не учиться же мне здесь, да?{/i}}"
    "Я не сильно воодушевилась идеей глотать холодное пюре с комочками и котлетой из массы неизвестного происхождения, как было в школе, но подняться вверх по лестнице навстречу своему будущему - мысль слишком глубокая и пугающая."
    "Проследовав за студентками я снова удивляюсь: столовая, в моей голове обязанная иметь вместо приличных стен сплошные пятна облезшей краски и, непременно, побитый плиточный пол бледно-бордового оттенка, на деле оказывается симпатичным маленьким помещением со светлыми стенами и уютным ремонтом."
    scene bg cafeteria at half_size
    show krista happy at half_size
    with dissolve
    "Пока я становлюсь в очередь, разглядывая одноразовые контейнеры с привлекательным содержимым за стеклом витрины, количество голодных студентов позади растёт в геометрической прогрессии."
    "??????" "Не врала видимо про очереди до лесенки.."
    "??? 1" "Не врала. Иногда и в две колонны, и по лестнице стоят, так что пройти невозможно."
    "Я поворачиваю голову и сталкиваюсь взглядом с большими весело прищуренными глазами удивительного цвета."
    "??????" "А ты новенькая, да? Я тебя с начала года не помню."
    "{i}Мне повезло наткнуться на старосту? Супер. Если я не пойду на занятие она мне или лекцию прочитает или ответственному за группу нажалуется.{/i}"
    me "Ага, я [pn], недавно поступила. А ты староста? Или всех тут сразу запоминаешь?"
    "??????" "А что, похожа?"
    "Она строит суровое лицо и картинно приосанивается, что ей совсем не идёт и вызывает у меня улыбку. Но хватает её ненадолго и вскоре она снова принимает дружелюбный вид."
    "??????" "Нет, старосты у нас все серьёзные, кто-то даже чересчур.. А вообще я всех с первого курса знаю, или хотя бы на лицо запомнила."
    me "Ого, это же больше тысячи человек, наверное."
    "Становится слегка неуютно от того, что во сне кто-то видит, что я здесь чужой человек.. {p=0.1}Но эта очаровательная болтливая девочка невольно рассеивает все мои подозрения."
    "??? 1" "Криста!"
    show krista back
    "Она шустро оборачивается и заводит короткую беседу со знакомой в очереди, пока я озадаченно разглядываю её рыжую макушку, думая о том, как поразительно детальны бывают сны."
    "{i}Значит, Криста. Она кажется неплохим человеком. Наверное, именно о такой подруге я мечтала в школе.{/i}"
    show krista happy
    "Наконец она поворачивается лицом ко мне, и, пробежавшись глазами по витрине в очередной раз, задаёт вопрос:"
    krista "Почему к нам решила поступить?"
    "Где-то я слышала, что говорить окружающим во сне что ты спишь - плохая идея, так что приходится задуматься над ответом."
    me "Ну.. Модненько у вас тут, и кормят вкусно."
    "Криста на мгновение прищуривается и внимательно всматривается в мои глаза, но тут же меняет выражение лица и начинает привычно широко улыбаться."
    krista "Ха-ха, кормят правда хорошо, но чтоб поступали из-за этого я ещё не слышала. А что тебе тогда больше всего нравится?"
    "{i}Чёрт, она же не может догадаться что я никогда тут не ела? Не может ведь..{/i}"
    me "Ну-у..."
    "{i}Так, что там говорила та девочка?{/i}"
    me "Пицца тут вкусная."
    krista "Да, её тут быстрее всего разбирают. Кто-то поэтому по 3 штуки набирает, а потом ни с кем не делятся."
    "Пока мы болтали очередь значительно сдвинулась вперёд, и оказалось, что через одного человека наступит моя очередь заказывать."
    menu:
        "Пицца и сок":
            pass
        "Пицца и кола":
            pass
        "Пицца и вода":
            pass
    hide krista
    show cafeteria_lady at half_size
    menu:
        "Очередь продвигается ещё раз приводя меня к кассе буфета"

        "Здравствуйте, мне...":
            # i'm supposed to add a point to someone (the cafeteria lady?? or maybe krista)
            "Милая женщина, заведующая кассой и, видимо, всем буфетом, здоровается со мной в ответ."
        "Мне, пожалуйста...":
            "Передо мной милая женщина, заведующая кассой и, видимо, всем буфетом, резво вбивает стоимость моих покупок на память, а я удивляюсь, как можно запомнить столько всего."
    
    "Пока она ищет все необходимое мне за прилавком я быстро ощупываю карманы, только сейчас осознав, что денег у меня может и не оказаться.."
    "Но я обнаруживаю здесь свою карту и прикладываю к терминалу."
    "{i}Интересно, сколько на счету денег?{/i}"
    scene bg cafeteria_table at half_size
    "Присев за свободный столик, откусываю кусочек пиццы и сразу понимаю, что любят её студенты определённо не просто так."
    show krista happy at half_size
    "Пока я жую свой завтрак, уставившись в одну точку, ко мне подсаживается Криста, держа в руках контейнер с каким-то ярким и вкусным на вид салатом."
    "Видимо, не имея привычки болтать за едой, она достаёт телефон и начинает увлечённо читать какой-то длинный пост в соцсети. Не то чтобы я любитель нарушать личные границы, но молчать во время еды точно не привыкла."
    me "Что читаешь?"
    krista "Да так, листаю последние новости из колледжа."
    me "А-а, типа подслушки?"
    krista "Она самая."
    "Она улыбается, не отрывая взгляда от экрана и продолжает с аппетитным хрустом жевать морковку."
    "{i}Никогда не любила салаты, но этот кажется таким аппетитным.{/i}"
    "Она поднимает глаза и замечает мой интерес к её еде, вежливо поясняя."
    krista "Это «парус». Он тут мой любимый."
    "Я задумчиво киваю, запоминая причудливое название на следующий раз."
    "{i}Следующий раз? Да через час или два я проснусь и никакого обеда не будет.{/i}"
    "??????" "Орлова!"
    show tutor angry at half_size
    "Не ожидав услышать здесь свою фамилию я вздрагиваю и нахожу глазами высокую молодую женщину, стоящую в очереди и прожигающую меня взглядом, скрестив руки на груди."
    "Увидев на моем лице страх вперемешку с недоумением, Криста склоняется ко мне и шепчет:"
    krista "Это Олеся Альбертовна. Она - твоя тьютор, наверное."
    "Услышав это слово во второй раз я догадываюсь, что тьютор - тот самый ответственный за группу человек, и его присутствие сейчас здесь меня совсем не радует."
    tutor "У тебя лекция идёт уже 15 минут, а ты что-то не торопишься."
    "{i}Ой-ё.. Надо прикинуться дурочкой, обычно срабатывает.{/i}"
    me "Да? А я просто забыла совсем."
    "Криста мягко вклинивается в разговор, стараясь спасти моё положение."
    krista "Давайте я ее провожу! В какой аудитории лекция?"
    tutor "Мне вас отметить нужно, сейчас вместе пойдём."
    "Новая знакомая смотрит на меня с лёгким сожалением."
    krista "Потом увидимся, я только узнаю твою группу и покараулю!"
    "Я киваю ей и хмуро допиваю свой напиток, когда Олеся Альбертовна подходит и ведёт меня за собой в злосчастный кабинет."
    scene bg classroom
    "Поднявшись по лестнице и пройдя ещё пару шагов мы оказываемся в просторном кабинете, заполненном, судя по всему, моими одногруппниками."
    "Я сажусь за стол рядом с одним из них и кидаю взгляд в его сторону."
    show timur at half_size
    "На столе раскрытая тетрадь, в которой не написано ни словечка, ручка вертится между длинными пальцами, приятно позвякивая о серебряные кольца. Одной левой он играет во что-то на телефоне."
    "{i}А у меня ведь ни ручки ни тетрадки. Ну, хоть парни тут нормальные. Этот вроде Тимур.{/i}"
    "Я вздыхаю и провожаю злобным взглядом тьютора, прекратившую нас отмечать и наконец-то покидающую аудиторию."
    "Перевожу взгляд на преподавателя, затем на доску и,  ознакомившись с темой лекции, закатываю глаза."
    "{i}Просто подарок судьбы. Даже во сне поступила на графический дизайн. Никогда не любила рисовать..{/i}"
    "Я подпёрла подбородок руками, вымучено зажмурилась и нахмурила брови, и честно попробовала вникнуть в речь преподавателя.."
    hide timur
    "Преподователь" "Расстановка акцентов - ключевой момент создания композиции. Главный её элемент - фокус, определяющий концентрацию внимания зрителя на важнейших деталях дизайн-объекта..."
    timur "Эй.."
    "Я раздражённо скосила взгляд на потревожившего меня соседа и тут же прыснула от смеха:"
    show timur inked at half_size
    "Ручка, 2 минуты назад находившаяся в его руке, оказалась прокушена и вымазала весь его рот чёрными чернилами."
    "В ответ на мой смешок он не разозлился - даже наоборот, его самого ситуация точно веселила."
    timur "У тебя салфетки нет?"
    "На его счастье, я всегда носила в кармане толстовки маленькую пачку влажных салфеток, чтоб не пачкать экран телефона, которую нашла там и сейчас."
    me "Ага."
    "Парень старательно растирал губы и кожу вокруг, периодически издавая тихие ругательства, чем отвлекал меня от лекции, но и смешил."
    timur "Спа-асибочки."
    "Когда все чернила остаются на салфетке он не ищет у одногруппников новой ручки, просто продолжая играть во что-то смутно знакомое, теперь уже двумя руками."
    me "Ого, я думала в неё лет 10 как не играет никто."
    timur "А я ценитель. шаришь?"
    "Найдя общую тему для разговора мы так увлекаемся, что переходим от размеренного шёпота к оживлённому разговору вслух и получаем замечание преподавателя."
    "Тимур переходит на шёпот и продолжает болтать, но я замолкаю, все ещё не зная, кто и что может сделать со мной за неподчинение в этом кошмарном сновидении, которое постепенно перестаёт казаться мне сколько-нибудь страшным.. {w=0.5}Вскоре затихает и он."
    "Какое-то время я настойчиво заставляю себя слушать монотонную речь об иерархии объектов на фрейме, но стресс и скука берут верх над моим телом, и я проваливаюсь в сон.."
    scene bg black at half_size
    "..."
    "Я просыпаюсь от толчка в плечо."
    "{i}Я ПРОСЫПАЮСЬ!?{/i}"
    "Я с глубоким вдохом открыла глаза и рывком подняла голову. передо мной оказался... Тимур."
    scene bg classroom at half_size
    show timur at half_size
    with dissolve
    me "Что за черт!?"
    timur "Я тебя вообще-то разбудил, а ты обзываешься."
    "Проигнорировав его я подскакиваю с места и быстрым шагом покидаю аудиторию."
    scene bg hall2 at half_size
    with dissolve
    "{i}Как.. как можно спать во сне? И вкусная еда, и вся эта лекция, как я это придумала если нифига в дизайне не понимаю!{/i}"
    "Я несусь по лестнице вниз, расталкивая попадающихся на пути студентов, намереваясь покинуть это место и вернуться домой."
    scene bg hall1 at half_size
    with dissolve
    menu:
        "Уйти домой или вернутся к лекции"

        "Остаться и слушать лекцию":

        "Уйти домой":
            






# TBD
label prologue_m:
label day1_m