# Misc variables
default ap = 3 # Action points
default pn = "Jane Doe" # Player name
image black = "#000"

# Characters
define krista = Character('Криста', color="#FA8072")
define timur = Character('Тимур', color="#191970")
define zhenya_f = Character('Женя', color="#D3D3D3")
define zhenya = Character('Женя', color="#a09d9d")

# Side characters
define me = Character("[pn]", color="#85aafa")
define mom = Character('Мама', color="#ffff80")
define nast = Character("Наставник", color="#ff8800") # I'll add the real color later
define sec = Character('Охрана', color="#040c36")
define tutor = Character('Тьютор', color="#ab23c4")

# Character relationship levels
default rl_krista = 0
default rl_timur = 0
default rl_zhenya_f = 0
default rl_zhenya = 0
default rl_amoeba = 0
default rl_reputation = 0
default rl_specialty = 0

# Transforms
transform half_size:
    zoom 0.5

$ flash = Fade(.25, 0, .75, color="#fff")

# Start
label start:
    "Как зовут вашу героиню?"
    $ pn = renpy.input("Введите имя").strip()
    jump prologue_f

label prologue:
    scene bg 01 at half_size

    """Я открыла глаза и уставилась в потолок.
    {p=0.5}В дальнем левом углу посеревший и свалявшийся от времени комок паутины.
    {p=0.5}{i}Если спросить прямо сейчас, какой из них мне симпатичен больше других, я бы сказала..{/i}"""

    show mom at half_size 
    mom "ПОДЪЁМ!"
    "В проёме грубо распахнутой двери стояла мама, кажется, пытавшаяся разбудить меня уже не в первый раз."
    mom "[pn], ты время вообще видела? Четвёртый час пошёл, так ведь всю жизнь проспишь."
    me "..Я бы сказала вон тот."
    "Буркнула я, ощутив красной вспышкой сквозь закрытые веки солнечный свет, и накрылась одеялом с головой."
    scene bg black at half_size
    with dissolve
    # add sound
    "Определив, что мама покинула комнату, с горестным вздохом захлопнув дверь, я достала из-под подушки нагретый мобильник." with vpunch
    me "11%, опять не поставила на ночь на зарядку."
    "Недовольно засопев, но не отложив телефон я решила, что маленький процент - не повод лишать себя удовольствия пролистать ленту рекомендаций в тик ток."
    "..."
    show phone tt at half_size
    "Не пропустив ни одного сюжета о семейных разборках сомнительного уровня достоверности  я с досадой смотрю на прощальный мерцающий экран, который сообщает о полной разрядке устройства."
    me "Да ладно, блин, я не дослушала.."
    "Приходится приподняться на локтях чтоб дотянуться до наручных часов, хотя даётся мне это не без труда."
    scene bg room at half_size
    with dissolve
    "17:41"
    "{i}Хороший день начинается с хорошего завтрака.{/i}"
    "..."
    scene bg kitchen at half_size
    show mom angry at half_size
    with dissolve
    "Выслушивая лекцию о бесполезности собственного существования каждый день, как ни странно, начинаешь обижаться на человека, который эту лекцию читает."
    me ".. И плевать я хотела на твою подругу и на её бесценную отличницу дочку. Я - твоя дочь, уж извини, но какая есть!"
    "Последнюю фразу заглушил грохот двери моей комнаты, который, наверное, слышали соседи ещё на пару этажей вниз." with vpunch # add sound
    scene bg pc sun at half_size
    with dissolve
    "Подавляя неясные тяжёлые мысли каким-то вирусным навязчивым хитом я натягиваю наушники и щёлкаю кнопкой на блоке питания родного пк."
    "Выпрямившись на стуле я тут же недовольно сощурилась."
    me "Задолбало это солнце!"
    "Взбешённая очередным лучиком света, проскользнувшим в узкую щель непроницаемых штор и лизнувшим моё лицо, я рывком стягиваю две их части."
    # add sound
    scene bg pc message at half_size
    with dissolve
    "Теперь в комнате кромешная тьма. {i}Наконец.{/i}"
    "\"18:30\". Открываю браузер с намерением глянуть какой-нибудь остросюжетный сериальчик под чипсы и остатки чёрного чая в кружке, которая стоит здесь уже.. {w=0.1}Не так важно."
    "На главной странице браузера меня встречает яркий малиновый закат, а я задумываюсь: {i}Когда я видела такой в последний раз? А если вспомнить, я вообще в последнее время видела небо?{/i}"
    "Любопытная рука тянется с намерением сдвинуть занавеску, но с резким \"блим\" на компьютер приходит уведомление от одного из моих интернет-друзей, которому невозможно не ответить." # add sound
    "..."
    "Перекинувшись парой фраз со старым знакомым я бодро перевожу курсор на крест и кликаю на иконку любимой игры.."
    scene bg pc game at half_size
    "..."
    "Время пролетает незаметно. когда веко на левом глазу начинает подергиваться от осознания скудности ума моих товарищей по команде я решаю свернуть вкладку. Глаза слипаются, я подавляю зевок, но спать, конечно, еще не хочется."
    scene bg pc at half_size
    "..."
    scene bg pc thread at half_size
    with dissolve
    "20 минут спустя я лежу на протянутой по столу руке, с приоткрытым ртом и прикрытыми веками, скролля ветку комментариев под постом к заинтересовавшему меня треду.."
    "user_865909668: очевидно что это «маджента». аытор, прикупи мб монитор нормальный а не калькулчтор"
    "kotikii.wau: Какая маджента?? Это классический «закат в Майами». Учите колористику, прежде чем писать че попало."
    "dimonkpasavva21: это если че вообще фильтр «насыщенность» на 100 проц. в рж такого неба не бывает, расходимся"
    "user_865909668: @dimonkpasavva21, выиди на улицу хоть раз, эксперт диваный. бывант и не такое."
    "Pankihoi097: Ребят вот вы серьезно? 228 коммов из-за оттенка? Это СИНИЙ в тенях всё решает. Без синего этот ваш малиновый — тупо грязное пятно."
    "pe4enkonzm: @Pankihoi097, синий там только в твоей голове. а это холодный розовый"
    "user_865909668: @pe4enkonzm, боже мой ты глаза прлтри. здесь глубккий винный градиент."

    menu:
        me "Ну не знаю, мне кажется.."

        "Это синий":
            pass
        "Это фуксия":
            pass
    
    "s0nechkaTOPluv: Боже, какая разница... красиво же."
    "dimonkpasavva21: @s0nechkaTOPluv, разница в том что люди деградируют и не видят ниче вообще. это ФУКСИЯ"
    "Anonimguest: Всё это — просто цифры. RGB: 255, 0, 255. О чем тут спорить? Математика не врет."
    "user_865909668: @Anonimguest, математтка так тт не учитывает восприятие. для кого то это цвет надежды, а для кого то цвет крови."
    "kotikii.wau: О, философы в чате. Сейчас еще про смысл жизни затирать начнут…"

    "Я вглядываюсь в своё отсутствующее выражение лица в отражении монитора..."
    scene bg pc ad at half_size
    "... И жмурюсь от рези в глазах! На экран спасительной тёмной темы вырывается стерильно белая реклама с тошнотворно-оранжевым логотипом в виде Грифона. «МВЕК - твой второй дом»"
    "С губ непроизвольно срывается злобный смешок"
    me "Да, в моем доме тоже пытаются отжать остатки ментального здоровья."
    "Пальцы резво соскальзывают с колёсика мыши к левой кнопке и, возможно, чрезмерно резко щёлкают на крестик."
    scene bg pc at half_size
    "Я перевожу взгляд в нижний угол экрана.. 2:51, 25.08."
    "Снова бегло читаю комментарии под постом, общей суммы слов которых хватило бы на тонкую книжонку.."
    me "Вот людям заняться нечем."
    "Придя к выводу о том, что этих рассуждений мне недостаточно для вынесения своего вердикта, я решаю довериться искусственному интеллекту и набираю текст, не глядя на клавиатуру: \"алиса какой цвет лучше фуксия ил..\""
    scene bg pc ad at half_size
    me "Да что за чёрт!"
    "На этот раз я даже не успеваю отклонить назойливое приглашение \"домой\", когда в лс приходит сообщение от человека, подписанного единственным кричащим словом \"Наставник\"."
    nast "Интересный выбор стратегии"
    menu:
        "Пару секунд я размышляю, кинуть интригующего человека в игнор или попробовать ответить.."

        "Проигнорировать его.":
            me "Ну и бред."
            "Я заканчиваю печатать свой запрос, по-прежнему не отводя глаз от экрана, когда приходит второе уведомление.."
            nast "Но, пожалуй, не самая эффективная."
            "На этот раз я, не задумываясь, гневно набираю быстрый ответ:"
            me "че ты несешь? подарки я не продаю, микрозайм мне не нужен, фотку свою не пришлю, ищи кого-то другого"

        "Ответить ему.":
            "Я хмуро и медленно моргаю, не представляя что ему от меня нужно, и все же решаюсь набрать ответ:"
            me "чего? какие стратегии"
            nast "Он ждёт, что ты выберешь нужную стратегию"
            "Измождённое сознание мрачнеет. Неудивительно, если посчитать, сколько уже я здесь сижу."
            "{i}Чёрт знает кто этот \"Он\", и он кого-то ждёт, замечательно, а я тут..{/i}"

    nast "Он ждёт не \"кого-то\", он ждёт того, кто устал быть никем"
    "Моя правая бровь изогнулась, кажется, почти под прямым углом."
    me "Боже, сколько пафоса. Не знала что коучи теперь и в 3 ночи написывают."
    "Отмахнувшись от ещё более откровенного бреда я кликаю на спасительные 3 точки и блокирую собеседника, который, совершенно точно, не в себе."
    me "Новая разводная схема что-ли?"
    "Я подавляю зевок и невольно прикрываю опухшие веки..."
    "Шорх!" # add sound
    # Add a white screen transition or something
    "Моё тело не собирается функционировать ни под каким предлогом, но вдруг вокруг становится подозрительно светло."
    "Лениво размыкается веко правого глаза и тут же схлопывается в панике от вспышки ярко-рыжего неба в паре метров перед собой."
    me "Мама? Ну и зачем она.."
    "Сил хватает только на то чтоб натянуть капюшон на лицо."
    scene bg black at half_size
    "..."
    scene bg lobby:
        half_size
        blur 40
    show sec angry:
        half_size
        blur 40
    with flash
    "???" "Ну ты там издеваешься что ли!?"
    "Густой нечленораздельный голос в голове застаёт меня врасплох"
    me "Че-его?"
    "На заданный, казалось, шёпотом вопрос прилетает быстрый и раздражённый ответ."
    "???" "Да ничего, если студенческий забыла отойди и позвони тьютору, а не стой тут как.."
    scene bg lobby at half_size
    show sec angry at half_size
    "Конец предложения тонет в звонком окрике немолодой женщины, видимо, предназначающемся для меня."
    sec "Вон у тебя студенческий, я отсюда в кармане вижу!"
    me "СТУДЕНЧЕСКИЙ?"
    "Я бросаю судорожный взгляд поочерёдно на каждый из карманов своих джинс и обнаруживаю в левом... {w=0.5}{cps=*0.75}Торчащий краешек синей корочки.{/cps}"
    jump day1

label day1:
    scene bg lobby at half_size
    show sec angry at half_size
    with dissolve
    "Мне хватает осознания того, что я сейчас в том месте, в которое не приходила по доброй воле, так что я, не доставая никакой мифический студенческий, разворачиваюсь и пытаюсь протиснуться сквозь плотную толпу.. {w=0.2}{cps=*0.9}студентов??{/cps}"
    hide sec angry with dissolve
    "{i}Да что это за фигня?! я вроде в детстве не лунатила, так почему в 16 лет..{/i}"
    "Я делаю успехи, истерично распихивая локтями молодых людей, но меня грубо выталкивают назад и по инерции я разворачиваюсь.."
    show sec angry at half_size
    sec "Так.."
    "Уставившись округлившимися глазами на женщину в чёрной робе с надписью \"охрана\",  с которой оказалась лицом к лицу, я теряюсь.."
    me "Эм.. я тут.."
    sec "Что за цирк?"
    "Не дождавшись от меня ни вразумительного ответа, ни активных действий, она выхватывает загадочный документ из моего кармана и победно произносит, раскрывая и жадно и изучая каждую строчку.."
    sec "Если ещё раз здесь представление устроишь я тебя вообще не пропущу, понятно?"
    "Я подкатываю глаза в ответ на эту возмутительную фразу и даже не успеваю сказать, что они вообще-то, ошиблись студентом, как сзади меня бесцеремонно вдавливают в турникет и я вваливаюсь в просторный ярко выглядящий коридор."
    scene bg hall1 at half_size
    with dissolve
    "Я прижимаюсь спиной к стене в попытке найти опору, глубоко вдыхая воздух с запахом еды, чьих-то цветочных духов и чего-то ещё неуловимо приятного.."
    "{i}Так, ладно. Когда-то же кончится эта человеческая лавина? Под шумок пролезу и обратно.{/i}"
    "Обратив внимание на интерьер коридора я, к удивлению, вижу не постсоветскую сказку, а стильно оформленное помещение. Под ногами лежит не вековой растрескавшийся бетон, а крупная светлая плитка, намытая до блеска. На стене - фотографии счастливых студентов в компании молодых преподавателей."
    "Чем дольше я разглядываю эти стены, тем спокойнее на душе мне становится, ведь приходит очевидное осознание того, что это просто сон."
    "{i}Один из самых кошмарных снов, в котором мне придётся заниматься разными невероятно весёлыми активностями и прочей ересью, обыденной для порядочного студента.{/i}"
    "Когда глаза начинают болеть от количества прочитанных за раз слов, я впервые слышу среди несвязного шума (характерного скорее для имитирования диалогов массовкой в каких-нибудь фильмах) вполне живое обсуждение.."
    "??? 1" "..Ага, и надеюсь к обеду всю пиццу не сожрали, как обычно."
    "??? 2" "Ну ты надейся главное. Я выхожу вчера из кабинета, она с лекции пораньше отпустила, спускаюсь в столовую, а там очередь не то что до гардероба, прям до лестницы! Так что на большой перерыв лучше..."
    "{i}Вот прям до лестницы? Неа, так в столовых не кормят.{/i}"
    "Я с интересом провожаю взглядом девочку, которая продолжает отчаянно жестикулировать подруге, наверное подводя к развязке своей истории."
    "Ещё минуту назад я не представляла чем здесь можно заняться, но после разговора о еде вдруг почувствовала совсем рядом аромат кофе и тёплых булочек."
    "{i}Ну не учиться же мне здесь, да?{/i}}"
    "Я не сильно воодушевилась идеей глотать холодное пюре с комочками и котлетой из массы неизвестного происхождения, как было в школе, но подняться вверх по лестнице навстречу своему будущему - мысль слишком глубокая и пугающая."
    "Проследовав за студентками я снова удивляюсь: столовая, в моей голове обязанная иметь вместо приличных стен сплошные пятна облезшей краски и, непременно, побитый плиточный пол бледно-бордового оттенка, на деле оказывается симпатичным маленьким помещением со светлыми стенами и уютным ремонтом."
    scene bg cafeteria at half_size
    show krista happy at half_size
    with dissolve
    "Пока я становлюсь в очередь, разглядывая одноразовые контейнеры с привлекательным содержимым за стеклом витрины, количество голодных студентов позади растёт в геометрической прогрессии."
    "??????" "Не врала видимо про очереди до лесенки.."
    "??? 1" "Не врала. Иногда и в две колонны, и по лестнице стоят, так что пройти невозможно."
    "Я поворачиваю голову и сталкиваюсь взглядом с большими весело прищуренными глазами удивительного цвета."
    "??????" "А ты новенькая, да? Я тебя с начала года не помню."
    "{i}Мне повезло наткнуться на старосту? Супер. Если я не пойду на занятие она мне или лекцию прочитает или ответственному за группу нажалуется.{/i}"
    me "Ага, я [pn], недавно поступила. А ты староста? Или всех тут сразу запоминаешь?"
    "??????" "А что, похожа?"
    "Она строит суровое лицо и картинно приосанивается, что ей совсем не идёт и вызывает у меня улыбку. Но хватает её ненадолго и вскоре она снова принимает дружелюбный вид."
    "??????" "Нет, старосты у нас все серьёзные, кто-то даже чересчур.. А вообще я всех с первого курса знаю, или хотя бы на лицо запомнила."
    me "Ого, это же больше тысячи человек, наверное."
    "Становится слегка неуютно от того, что во сне кто-то видит, что я здесь чужой человек.. {p=0.1}Но эта очаровательная болтливая девочка невольно рассеивает все мои подозрения."
    "??? 1" "Криста!"
    show krista back
    "Она шустро оборачивается и заводит короткую беседу со знакомой в очереди, пока я озадаченно разглядываю её рыжую макушку, думая о том, как поразительно детальны бывают сны."
    "{i}Значит, Криста. Она кажется неплохим человеком. Наверное, именно о такой подруге я мечтала в школе.{/i}"
    show krista happy
    "Наконец она поворачивается лицом ко мне, и, пробежавшись глазами по витрине в очередной раз, задаёт вопрос:"
    krista "Почему к нам решила поступить?"
    "Где-то я слышала, что говорить окружающим во сне что ты спишь - плохая идея, так что приходится задуматься над ответом."
    me "Ну.. Модненько у вас тут, и кормят вкусно."
    "Криста на мгновение прищуривается и внимательно всматривается в мои глаза, но тут же меняет выражение лица и начинает привычно широко улыбаться."
    krista "Ха-ха, кормят правда хорошо, но чтоб поступали из-за этого я ещё не слышала. А что тебе тогда больше всего нравится?"
    "{i}Чёрт, она же не может догадаться что я никогда тут не ела? Не может ведь..{/i}"
    me "Ну-у..."
    "{i}Так, что там говорила та девочка?{/i}"
    me "Пицца тут вкусная."
    krista "Да, её тут быстрее всего разбирают. Кто-то поэтому по 3 штуки набирает, а потом ни с кем не делятся."
    "Пока мы болтали очередь значительно сдвинулась вперёд, и оказалось, что через одного человека наступит моя очередь заказывать."
    menu:
        "Пицца и сок":
            pass
        "Пицца и кола":
            pass
        "Пицца и вода":
            pass
    hide krista
    show cafeteria_lady at half_size
    menu:
        "Очередь продвигается ещё раз приводя меня к кассе буфета"

        "Здравствуйте, мне...":
            "Милая женщина, заведующая кассой и, видимо, всем буфетом, здоровается со мной в ответ."
        "Мне, пожалуйста...":
            $ rl_amoeba += 1
            "Передо мной милая женщина, заведующая кассой и, видимо, всем буфетом, резво вбивает стоимость моих покупок на память, а я удивляюсь, как можно запомнить столько всего."
    
    "Пока она ищет все необходимое мне за прилавком я быстро ощупываю карманы, только сейчас осознав, что денег у меня может и не оказаться.."
    "Но я обнаруживаю здесь свою карту и прикладываю к терминалу."
    "{i}Интересно, сколько на счету денег?{/i}"
    "Присев за свободный столик, откусываю кусочек пиццы и сразу понимаю, что любят её студенты определённо не просто так."
    show krista happy at half_size
    "Пока я жую свой завтрак, уставившись в одну точку, ко мне подсаживается Криста, держа в руках контейнер с каким-то ярким и вкусным на вид салатом."
    "Видимо, не имея привычки болтать за едой, она достаёт телефон и начинает увлечённо читать какой-то длинный пост в соцсети. Не то чтобы я любитель нарушать личные границы, но молчать во время еды точно не привыкла."
    me "Что читаешь?"
    krista "Да так, листаю последние новости из колледжа."
    me "А-а, типа подслушки?"
    krista "Она самая."
    "Она улыбается, не отрывая взгляда от экрана и продолжает с аппетитным хрустом жевать морковку."
    "{i}Никогда не любила салаты, но этот кажется таким аппетитным.{/i}"
    "Она поднимает глаза и замечает мой интерес к её еде, вежливо поясняя."
    krista "Это «парус». Он тут мой любимый."
    "Я задумчиво киваю, запоминая причудливое название на следующий раз."
    "{i}Следующий раз? Да через час или два я проснусь и никакого обеда не будет.{/i}"
    "??????" "Орлова!"
    show tutor angry at half_size
    "Не ожидав услышать здесь свою фамилию я вздрагиваю и нахожу глазами высокую молодую женщину, стоящую в очереди и прожигающую меня взглядом, скрестив руки на груди."
    "Увидев на моем лице страх вперемешку с недоумением, Криста склоняется ко мне и шепчет:"
    krista "Это Олеся Альбертовна. Она - твоя тьютор, наверное."
    "Услышав это слово во второй раз я догадываюсь, что тьютор - тот самый ответственный за группу человек, и его присутствие сейчас здесь меня совсем не радует."
    tutor "У тебя лекция идёт уже 15 минут, а ты что-то не торопишься."
    "{i}Ой-ё.. Надо прикинуться дурочкой, обычно срабатывает.{/i}"
    me "Да? А я просто забыла совсем."
    "Криста мягко вклинивается в разговор, стараясь спасти моё положение."
    krista "Давайте я ее провожу! В какой аудитории лекция?"
    tutor "Мне вас отметить нужно, сейчас вместе пойдём."
    "Новая знакомая смотрит на меня с лёгким сожалением."
    krista "Потом увидимся, я только узнаю твою группу и покараулю!"
    "Я киваю ей и хмуро допиваю свой напиток, когда Олеся Альбертовна подходит и ведёт меня за собой в злосчастный кабинет."
    scene bg classroom
    "Поднявшись по лестнице и пройдя ещё пару шагов мы оказываемся в просторном кабинете, заполненном, судя по всему, моими одногруппниками."
    "Я сажусь за стол рядом с одним из них и кидаю взгляд в его сторону."
    show timur at half_size
    "На столе раскрытая тетрадь, в которой не написано ни словечка, ручка вертится между длинными пальцами, приятно позвякивая о серебряные кольца. Одной левой он играет во что-то на телефоне."
    "{i}А у меня ведь ни ручки ни тетрадки. Ну, хоть парни тут нормальные. Этот вроде Тимур.{/i}"
    "Я вздыхаю и провожаю злобным взглядом тьютора, прекратившую нас отмечать и наконец-то покидающую аудиторию."
    "Перевожу взгляд на преподавателя, затем на доску и,  ознакомившись с темой лекции, закатываю глаза."
    "{i}Просто подарок судьбы. Даже во сне поступила на графический дизайн. Никогда не любила рисовать..{/i}"
    "Мысль о побеге становится заманчивее с каждой минутой."
    "{i}.. Но если я уйду, вдруг она за нож схватится или ещё чего похуже? Произойти же может что угодно.. Нет, так не пойдёт.{/i}"
    "Скрипя зубами, я остаюсь на паре и продолжаю упрямо поглощать новую информацию. Вводный курс дизайна - не самое неприятное, что может произойти."
    "Я подпёрла подбородок руками, вымучено зажмурилась и нахмурила брови, и честно попробовала вникнуть в речь преподавателя.."
    hide timur
    "Преподователь" "Расстановка акцентов - ключевой момент создания композиции. Главный её элемент - фокус, определяющий концентрацию внимания зрителя на важнейших деталях дизайн-объекта..."
    timur "Эй.."
    "Я раздражённо скосила взгляд на потревожившего меня соседа и тут же прыснула от смеха:"
    show timur inked at half_size
    "Ручка, 2 минуты назад находившаяся в его руке, оказалась прокушена и вымазала весь его рот чёрными чернилами."
    "В ответ на мой смешок он не разозлился - даже наоборот, его самого ситуация точно веселила."
    timur "У тебя салфетки нет?"
    "На его счастье, я всегда носила в кармане толстовки маленькую пачку влажных салфеток, чтоб не пачкать экран телефона, которую нашла там и сейчас."
    me "Ага."
    "Парень старательно растирал губы и кожу вокруг, периодически издавая тихие ругательства, чем отвлекал меня от лекции, но и смешил."
    timur "Спа-асибочки."
    "Когда все чернила остаются на салфетке он не ищет у одногруппников новой ручки, просто продолжая играть во что-то смутно знакомое, теперь уже двумя руками."
    me "Ого, я думала в неё лет 10 как не играет никто."
    timur "А я ценитель. шаришь?"
    "Найдя общую тему для разговора мы так увлекаемся, что переходим от размеренного шёпота к оживлённому разговору вслух и получаем замечание преподавателя."
    "Тимур переходит на шёпот и продолжает болтать, но я замолкаю, все ещё не зная, кто и что может сделать со мной за неподчинение в этом кошмарном сновидении, которое постепенно перестаёт казаться мне сколько-нибудь страшным.. {w=0.5}Вскоре затихает и он."
    "..."
    menu:
        "Уйти домой или остаться на лекции"

        "Остаться и слушать лекцию":
            $ rl_reputation += 1
            $ rl_specialty += 1
            "Молодая девушка зачитывает текст презентации, дополняя её своими словами и полезными подробностями. Глядя на неё любой понял бы сразу, какой предмет она преподаёт."
            "Преподователь" "Негативное пространство, он же - воздух. Это не заполненные контентом участки дизайна. Они выделяют самое важное, создают паузы и делают дизайн лёгким для восприятия нашего глаза."
            "{i}Неужели кому-то это непонятно? Вроде бы очевидные вещи, просто приправленные умными профессиональными словами{/i}"
            "Преподователь" "..поэтому важно гармонично распределять графику, текст и свободное пространство, чтобы плакат не был перегруженным или слишком пустым."
            "Какое-то время я настойчиво заставляю себя слушать монотонную речь об иерархии объектов на фрейме, но стресс и скука берут верх над моим телом, и я проваливаюсь в сон.."
            scene bg black at half_size
            "..."
            "Я просыпаюсь от толчка в плечо"
            "{i}Я ПРОСЫПАЮСЬ!?{/i}"
            "Я с глубоким вдохом открыла глаза и рывком подняла голову. передо мной оказался..."
            scene bg 1_4 at half_size
            show timur at half_size
            me "Что за чёрт!?"
            timur "Я тебя вообще-то разбудил, а ты обзываешься."
            "Проигнорировав его я подскакиваю с места и быстрым шагом покидаю аудиторию."
            "{i}Как.. Как можно спать во сне? И вкусная еда, и вся эта лекция, как я это придумала если нифига в дизайне не понимаю!{/i}"
            "Я несусь по лестнице вниз, расталкивая попадающихся на пути студентов, намереваясь покинуть это место и вернуться домой."
        "Уйти домой":
            $ rl_amoeba += 1
            "Пусть я и не до конца уверена в безопасности своего решения, но просто остаться и слушать лекцию в моей ситуации - абсурд чистой воды."
            "{i}Неизвестно что будет если меня поймает Олеся Альбертовна, так что лучше держаться подальше от любых коридоров.. Если это вообще возможно{/i}"
            "Дождавшись, пока преподаватель отвлечётся на переключение слайдов в своём мониторе, я выскальзываю из кабинета и боязливо оглядываюсь по сторонам."
            scene bg 1_12 at half_size
            "Блуждающих студентов почти также много, как и во время перерыва, но я извлекаю из этого выгоду: пока их так много, заметить меня труднее."
            "{i}Плохо, что я не знаю куда она пошла. Но, если подумать.. Может, она переела в столовой и ушла домой?{/i}"
            "Успокоив мозг случайной глупостью, я отправляюсь на поиски пути наверх. Широкая лестница оказывается прямо за углом и выходит меня к витиеватому повороту."
            "Миновав его, я невольно оборачиваюсь и останавливаюсь чтоб оценить красоту оформления стен: часть коридора, в которой я нахожусь, разрисована от пола и до потолка людьми, животными и существами самых разных цветов и размеров."
            "Пусть я совсем не разбираюсь ни в искусстве ни в дизайне, но не оценить эту прелесть просто нереально. Это необходимо запечатлеть на камеру."
            "Щёлк" # add sound
            "???" "Чё, дома пересматривать будешь?"
            "Услышав насмешливый голос откуда-то слева я не сразу понимаю, что наглый вопрос был адресован мне, и молча сдвигаюсь в сторону, чтоб захватить камерой другую часть стены, изображающую стайку милых алых рыбок с зонтиками."
            # the script says to add an anti smoling banner (huh?)
            "Уловив прямо возле себя едкий табачный запах я с отвращением отшатываюсь и разворачиваюсь влево - к его источнику."
            scene bg 1_13 at half_size
            "Вальяжно расположившись на 2 из 3 стоящих в ряд стульев он смотрит мне в глаза, не мигая."
            "Отметив явное недовольство в моих глазах, и точно понимая его причину, парень издевательски прищуривает глаза и затягивается, вбирая в лёгкие максимальное количество дыма, чтобы затем выдохнуть его прямо мне в лицо."
            "Я упрямо стою на месте и встречаю его взгляд своим, скривив губы и задержав дыхание."
            me "А тебе видимо все по плечу, да? Или ты не в курсе, что здесь не курят?"
            "Он отнимает от губ сигарету, стряхивая пепел в горшок с растением и заправляет за ухо тяжёлую прядь засаленных волос, упавшую на лоб."
            "???" "Я же вон сижу перед тобой. Курят, получается."
            "Я не нахожу остроумного ответа и просто отворачиваюсь. Хочется уйти отсюда прямо сейчас."
            "???" "Да и откуда тебе знать, что тут делают, а чего не делают, [pn]?"
            "В животе сворачивается змеёй неприятное чувство. Откуда?"
            me "Ты сейчас о чём?"
            "???" "Ну, ты же тут.. {w=0.2}{cps=*0.9}{i}Новенькая.{/i}{/cps}"
            "Я делаю несколько шагов. Не знаю куда именно, но подальше от этих стульев. Что-то в этом человеке заставляет меня чувствовать себя потерянной."
            "???" "Далеко не уходи. Там сейчас ремонт, фоткать больше нечего."
            "Я замираю. Оборачиваюсь через плечо, готовая выдать какую-нибудь гадость, но он даже не смотрит на меня. Парень изучает кончик тлеющей сигареты с таким видом, будто в этом угольке сокрыты все тайны вселенной."
            "Он лениво убирает ногу со второго стула, освобождая место, но сам даже не шевелится, чтобы потесниться."
            "???" "Ну? Будешь дальше изображать униженную и оскорблённую или признаешь, что тебе некуда прятаться?"
            "Он обводит свободной рукой разрисованную стену напротив."
            "???" "Тут хотя бы рыбки симпатичные. Можно бесконечно гадать, какого чёрта у них зонтики. Абсурд, правда?"
            "Я кидаю взгляд на свободный стул, на его волосы, затем на милых красных рыбок."
            "Сбежать в бетонный тупик или остаться здесь, в компании этого странного типа?"
            "С тяжёлым вздохом я возвращаюсь и сажусь на край стула, подальше от него, но всё же в зоне досягаемости дыма."
            me "Только если ты прекратишь курить."
            "Он пристально смотрит мне в глаза пару секунд, не меняя выражения лица, но затем ухмыляется и тушит сигарету, грубо вминая её в невинно белоснежную стену."
            "???" "Лучше?"
            me "Лучше."
            "Он откидывается на спинку стула, заложив руки за голову. Он весь пропитан табачной вонью, но теперь дым не режет глаза."
            "Я замечаю, какой у него уставший, почти мертвецкий вид. Будто он не спал, не ел и не пил несколько недель подряд. Впалые щеки, мешки из-под картошки под глазами.."
            "???" "Теперь мы сидим в больничной тишине и наслаждаемся.. Чем? Искусством?"
            "Я молчу, разглядывая оставшееся на стене некрасивое серое пятно с чёрной точкой посередине. Тишина здесь и правда какая-то густая, ватная."
            me "Что ты имел в виду, когда назвал меня новенькой?"
            "Меня терзает этот вопрос. Мне показалось, что он что-то знает. Будто он здесь не как часть системы, а как.. Я?"
            "???" "У тебя на лице написано это..."
            "Он неопределённо помахал пальцами в воздухе."
            "???" "\"Я хочу, чтобы это всё имело смысл\". Желание найти выход, логику, расписание. Старожилы таким не маются. Мы просто тут существуем."
            "Он закрывает глаза, и на мгновение кажется, что он уснул прямо так, сидя на твёрдом офисном стуле."
            me "Я не собираюсь здесь существовать."
            "Мой голос звучит не так уверенно, как хотелось бы."
            me "Я просто.. заблудилась?"
            "???" "Да мы все тут заблудились, [pn]. Просто кто-то ещё носится по лабиринту, а кто-то уже прилёг отдохнуть."
            "Он приоткрывает один глаз и смотрит на меня с какой-то странной жалостью."
            "???" "Ты вот слиняла с лекции. Думаешь, это бунт? Нет. Это такая.. Смена декораций. Твоя тьютор забудет твоё имя через пять минут после того, как ты выйдешь за дверь. В этом вся радость: ты можешь исчезнуть, а мир даже не вздрогнет."
            "Он снова замолкает, и я ловлю себя на том, что начинаю подстраиваться под его медленное, тяжёлое дыхание. Стены кажутся чуть ближе, чем раньше. Воздух становится тёплым и сонным."
            me "Не хочу знать откуда ты знаешь моё имя, но скажи, как зовут тебя?"
            "???" "А какая разница?"
            "Он улыбается одними уголками губ."
            "???" "Назови меня как-нибудь сама. В этом мире имена значат не больше, чем номерки в гардеробе, разве что не теряются."
            "{i}Об этом может мыслить только человек, у которого ежедневно уйма свободного времени. И, наверное, только двинутый.{/i}"
            "Я только сейчас осознаю, что мы сидим здесь уже слишком долго, и меня могли начать искать. Но странная дремота не даёт начать переживать по этому поводу."
            me "А.. Если меня тут найдут, пока пара идёт?"
            "???" "Расслабься, ты тут никому неинтересна. Прогуливай и сиди тут хоть каждую пару - ни у кого вопросов не будет."
            "Больше он не произносит ни слова."
            "Поддавшись стерильной тишине коридора, по которому за время нашего разговора не прошла ни 1 живая душа, я закрываю глаза и проваливаюсь в сон.."
            scene bg black at half_size
            "..."
            "Услышав громкие голоса студентов, видимо, покинувших аудитории на время перерыва, я просыпаюсь.."
            "{i}Я ПРОСЫПАЮСЬ!?{/i}"
            "{i}Почему я вдруг взяла и заснула здесь, рядом с ним? Он курит какую-то дрянь? Да разве можно вообще спать во сне!? И эта вкусная еда..{/i}"
            "В конце концов, все, встреченные мной здесь люди.. Я не могла просто придумать их всех прямо сейчас, человеческое сознание так не работает. Это не просто сон и отсюда нужно выбираться!"
            "Я несусь по лестнице вниз, расталкивая попадающихся на пути студентов, намереваясь покинуть это место и вернуться домой."
    "..."
    scene bg 0_11 at half_size
    show sec at half_size
    "Я подлетаю к турникету, тяжело дыша, но путь перекрывает знакомая охранница."
    me "Выпустите меня сейчас же!"
    sec "Куда это?"
    "Она ухмыляется, кажется издевательски, сложив руки на груди."
    me "В смысле \"куда?\" домой, на улицу! Выпустите меня!"
    sec "Я не могу."
    me "Всмысле \"не могу\"? Я не учусь здесь, я просто.. Заснула, вы понимаете?"
    sec "Я не могу тебя выпустить, пока ты не приняла условия."
    me "Какие к черту условия!? Вон сотня людей на улице, которых вы только что пропустили!"
    sec "Кричи не кричи, сейчас тебя отсюда никто не выпустит. Возвращайся."
    "В молчаливом отчаянии, трясущимися руками я достаю из кармана телефон и ищу в контактах мамин номер."
    show phone contacts at half_size
    "Номера не существует."
    "{i}Как понять..{/i}"
    "Я сжимаю ткань на груди, борясь с подступающей паникой, пролистываю вниз и набираю номер старого школьного друга."
    "Номер набран неправильно."
    "Не успев нажать кнопку вызова очередного контакта я вижу на панели уведомлений новое сообщение от знакомого:"
    "Наставник: адаптируйся."
    "{i}Это все просто какой-то бред{/i}"
    "Пошатываясь и держась за стену я заворачиваю в коридор, опускаюсь на пол и начинаю бесцельно покачиваться в стороны, обняв колени, стараясь вернуть себе ощущение реальности."
    scene bg 1_1 at half_size
    "Ноги болят от напряжения, слишком яркий свет от лампы режет глаза, но меньше всего меня сейчас волнует лёгкий дискомфорт."
    "Телефон в кармане вибрирует, видимо, пытаясь заставить обратить внимание на уведомление."
    "Я чувствую что умру, если открою глаза сейчас, но он жужжит ещё раз и ещё, и я со злостью выхватываю его из кармана, заранее продумывая изощрённый ответный текст."
    show phone gc at half_size
    "Чат группы, в котором я, оказывается, состою, разрывается самыми тупыми сообщениями."
    "Пролистав сообщения вверх я нахожу координаты кабинета тьюторов и направляюсь туда, ориентируясь по заботливо развешанным табличкам."
    "Дойдя, наконец, до кабинета я распахиваю дверь без стука и нахожу внутри единственную женщину, которая сообщает что Олеся Альбертовна сейчас не в колледже."
    "У неё же я узнаю своё расписание на сегодня: благо, остаётся всего одна пара, но вот что со мной будет после, если меня снова откажутся выпустить.."
    "Изучив табличку на стене, я без каких-либо эмоций поднимаюсь на этаж и вхожу в аудиторию."
    scene bg pcclass at half_size
    "Преподавателя не видно, но все распределились на группы по 6 человек."
    "{i}Волшебно, я попала на какую-то командную работу?{/i}"
    "Не обнаружив здесь островка безопасности в лице Тимура я подсаживаюсь к первой попавшийся группе ребят."
    "К счастью они не проявляют ко мне особого интереса, так что я выигрываю время на то чтобы прийти в себя."
    "..Но сзади раздаются тихие мерные шаги."
    show zhenya_m at half_size
    "???" "Ты опоздала? Я тебя не увидел."
    "Я приподнимаю голову и вижу прямо перед собой стройного, строго одетого парня. Хоть я сейчас и сижу, кажется, он намного выше меня."
    "Видимо, я молчу слишком долго, разглядывая его лицо, так что он улыбается одним уголком рта и слегка приподнимает бровь."
    "{i}Ой..{/i}"
    menu:
        "Что ответить:"

        "Ага, немного.. заблудилась в коридорах":
            "???" "Заблудилась?"
            "Он тихо хмыкает, и в его взгляде проскальзывает что-то похожее на снисхождение."
            zhenya "В первые дни это простительно. Я Женя, староста этой группы. Напомни имя, давай тебя отмечу."
            "{i}Староста... Ну конечно. У него даже пробор выглядит так, будто его вымеряли по линейке{/i}"
        "Ну да. а ты здесь местный надзиратель?":
            "Улыбка меркнет. Он выпрямляется, становясь ещё выше и холоднее, как снежная серая гора.."
            show zhenya_m cold
            zhenya "Я Женя - староста. И мне потом объяснять Олесе Альбертовне, почему у меня полгруппы в буфете отсиживается вместо пары. Фамилия?"
            "{i}Ой, какой мы важный. Смотрит так, будто видит наперед все мои будущие прогулы..{/i}"
    "Покончив с опоздавшими Женя садится на свободный стул возле меня и живо включается в обсуждение чего-то в команде."
    "Я замечаю, что вокруг с его приходом становится заметно тише, в глазах ребят возникает интерес к его словам и ещё что-то такое, что даёт мне понять - его здесь точно уважают."
    "Наконец, в кабинете появляется преподаватель, вовлекающая группу в обсуждение темы сегодняшней лекции."
    "Уткнувшись взглядом в лицо старосты я задумываюсь над весом человеческой жизни, нервно покусывая колпачок ручки. пластик скрипит на зубах и отслаивается, впиваясь в дёсна, но эта боль - единственное, что я сейчас могу взять под контроль."
    "{i}Даже если этот мир - сон, то Женя здесь - архитектор. А если реальность, то я окончательно проиграла этой жизни ещё до того, как открыла глаза на вахте, а он.. Такие, как он, создают день сами.{/i}"
    "Мысли проносятся в голове яркими вспышками, калечащими подсознание, звуки пульсируют в ушах и груди, вызывая тошноту и я перестаю чувствовать своё тело."
    scene bg pcclass:
        half_size
        blur 40
    show zhenya_m concerened:
        half_size
        blur 40
    with flash
    zhenya "[pn]!"
    "Я чувствую прохладные ладони на своих запястьях, сжимающие их ровно настолько, насколько нужно чтоб привести меня в чувство."
    "Я нахожусь на прежнем месте. Женя сидит передо мной, сжимая мои руки и глядя прямо в глаза, явно ища в них признаки сознания."
    scene bg pcclass at half_size
    show zhenya_m concerened at half_size
    zhenya "Ты чего? Заснула с открытыми глазами?"
    "Он слегка встряхивает мои руки, проверяя, вернулась ли я в реальность."
    "Я чувствую, как его пальцы - холодные и уверенные - на мгновение задерживаются на моей коже, прежде чем он отпускает меня и кивает на изгрызенную ручку, которую я всё ещё сжимаю в пальцах."
    show zhenya_m at half_size
    zhenya "Перестань её мучить, она тебе ничего плохого не сделала."
    "Убедившись в ясности моего взгляда он отдаляется, возвращаясь к привычной дистанции между двумя одногруппниками."
    "Я растерянно молчу, все ещё шокированная своим недавним состоянием, хотя осознаю необходимость поблагодарить Женю за поддержку и помощь."
    zhenya "Ты её слышала? Мы с тобой сегодня в паре за компьютером."
    me "Неа, извини, прослушала как раз этот момент."
    zhenya "Всем командам дана тема для создания проекта. Проект от каждой пары обсуждается в команде, а лучшая из пар выступит перед группой со своей презентацией. Наша тема - финансовая безопасность."
    "Я потёрла переносицу, собираясь признаться амбициозному напарнику в том, что не обладаю ни ораторским талантом, ни навыком создания презентаций, но парень, кажется, был готов помочь мне во всем с этим проектом."
    "{i}Да-а, что-то мне подсказывает, что для него главное не участие{/i}"
    "Оказалось, пока Женя приводил меня в чувства все разбились по парам и давно заняли по компьютеру на двоих, в стороне остались только мы."
    "Заметив мой блуждающий по мониторам взгляд, парень поднялся со стула, деликатно промолчав насчёт нашей вынужденной паузы, и занял свободный стол, пока я плелась следом."
    zhenya "Презентации часто делаешь?"
    me "Ну, не то чтобы прям хобби.. Кое-что могу, если ты об этом."
    "Он хмыкнул, кликая на оранжевую иконку приложения на рабочем столе."
    zhenya "Кое-что это уже что-то.. Так, \"финансовая безопасность\" - это целый блок тем, нужно придумать что-то конкретное. Есть идеи?"
    "Я смотрю на него с таким видом, что его взгляд смягчается, задержавшись на мгновение на моем лице, а затем опускается на клавиатуру."
    "Пальцы Жени так быстро перемещаются по буквам, что я перестаю успевать следить за ними уже на слове после пробела и просто рассматриваю его руки."
    "{i}Такие широкие ладони, но пальцы худые и длинные, как у пианиста. Ну, если он по утрам играет Шуберта, наверное, мало кто удивится{/i}"
    "Когда он перестаёт набирать текст я поднимаю глаза к монитору."
    "\"Методы минимизации финансовых рисков при долгосрочном планировании\""
    "Женя убирает руки от клавиатуры и поворачивает монитор чуть больше в мою сторону, ожидая реакции."
    zhenya "Так мы сможем захватить и страховку, и диверсификацию. Баллы за глубокое раскрытие накинет."
    "Скосив взгляд на моё лицо и проанализировав выражение он выгибает брови домиком."
    zhenya "Доступно для твоего понимания? Или стоит упростить формулировки для защиты?"
    "Я поджимаю губы и киваю с предельно серьёзным лицом. То, что из всех слов в одном лишь названии мне понятно только \"методы\" озвучивать я, конечно, не собираюсь. Парень издаёт короткий смешок, который едва заметно подёргивает уголок его губ."
    zhenya "Ладно. Сделаем вид, что я поверил твоему {i}экспертному кивку.{/i}"
    "Я нервно отворачиваюсь к стене и чувствую затылком его мимолётный ироничный взгляд."
    zhenya "Но на всякий случай, когда дойдём до слайда с диверсификацией, сделаем его в картинках. Для наглядности."
    "Я слышу в его голосе злую улыбку и начинаю закипать, но предъявить ему явно нечего."
    "{i}У-у, зараза. \"Экспертный кивок\".. Я тебе этот кивок ещё припомню, когда мы до информатики дойдём, зубрила{/i}"
    "Я кладу голову на руки и злобно поглядываю на парня, который с достоинством принял свою участь лидера проекта."
    "Пока он печатает текст его чёлка постоянно спадает на лоб, и он очень человеческим движением снова и снова сдувает её обратно."
    "Я невольно провожаю взглядом серую прядку, чувствуя, как постепенно остывает ярость внутри."
    "{i}И почему ты не оказался каким-нибудь прыщавым занудой? Прямо твоё тотемное животное{/i}"
    "Работать с идеальным старостой, который бесит своим высокомерием - это одно. Но работать с ним, когда у него красивые руки и эти.. Дурацкие волосы - это уже перебор. Несправедливо."
    zhenya "[pn]."
    "Он произносит моё имя так спокойно, будто мы сто лет знакомы, не отрываясь от экрана."
    zhenya "Раз уж ты закончила сверлить меня взглядом, подбери оформление. Нужно что-нибудь светлое и минималистичное."
    "Я вздрагиваю и начинаю часто моргать, сбрасывая наваждение."
    me "Да я и не сверлила."
    "Бурчу я, резко выпрямляясь и хватаясь за мышку."
    me "Я вообще-то... Анализировала структуру твоего заголовка."
    zhenya "Ну разумеется."
    "И снова в его голосе слышится скучающая улыбка, от которой хочется то ли влепить ему пощёчину, то ли.. "
    zhenya "Тогда анализируй активнее, а то не успеем до конца пары."
    "Я проигнорировала его и решила отнестись тщательнее к единственной поставленной задаче, развернув весь список оформления."
    "Когда я закончила то обнаружила Женю сидящим с осанкой прямее обычного, напряжённо набирающего кому-то сообщение."
    zhenya "[pn], слушай."
    "Он откладывает телефон, но гасит экран не сразу, так что я успеваю заметить бесконечный список пропущенных в мессенджере."
    zhenya "Мне нужно отойти, по вопросу. Без меня никак."
    "Он встаёт и опирается локтем на спинку моего стула, придирчиво оценивая задаток работы, и даже не произносит ничего уничижительного."
    zhenya "Оставлю тебя здесь одну на полчаса. Справишься с этой свободой или мне потом придётся чистить слайды с котятами и блёстками?"
    "Я хмурю брови и готовлюсь уколоть в ответ, но он опускает голову и впервые за день смотрит на меня открыто и серьёзно."
    "Кажется, хоть он и поддел меня, все же действительно хочет понять, справлюсь ли я сама."
    me "Иди уже."
    "Я демонстративно отворачиваюсь к монитору и поправляю текст на слайде."
    me "А то вдруг без тебя в деканате небо на землю упадет. Справлюсь я. А если увидишь блёстки в презентации - это моё авторское виденье."
    "Я слышу, как он беззвучно смеётся, выдыхая воздух прямо мне в затылок."
    zhenya "Авторское виденье, значит... Ладно, ловлю на слове. Если по возвращении обнаружу тут розовый замок вместо графиков - презентовать его будешь сама."
    hide zhenya_m
    "Его шаги удаляются, становясь тише на фоне общего гула аудитории, а я ещё пару секунд сижу неподвижно, боясь обернуться, но все таки смотрю назад, надеясь увидеть его, стоящего в дверном проёме."
    "{i}Так. это просто стресс. Пока я здесь мне просто очень нужна стабильность, а этот выскочка удачно подвернулся под руку.{/i}"
    "Я киваю себе с довольным видом и вызывающе выпрямляю спину, копируя его безупречную осанку, и тут же морщусь.. Неудобно. Как он вообще так живёт?"
    "Оставшись один на один с проектом, я растерянно сжимаю в руках мышку и оглядываюсь вокруг."
    "{i}Все и печатают что-то и поговорить успевают.. Блин, хоть бы он там быстрее закончил{/i}"
    "А пока я перечитываю уже написанное Женей, думая, что делать дальше.."
    menu:
        "Попытаться вникнуть и доделать проект.":
            $ rl_specialty += 1
            "Я прокручиваю титульный слайд и содержание, оказываясь на слайде \"введение\"."
            "На предыдущем слайде парень заботливо расписал что именно там должно быть написано, но формулировать от этого не легче.."
            # they want a god damn minigame
            # i'll do it later (page 15 of script)
        "Пустить все на самотёк.":
            $ rl_amoeba += 1
            "{i}А, к чёрту.{/i}"
            "Подумав пару минут я решаю, что этот проект, в общем-то, никак не повлияет на моё нахождение в этом колледже, а значит бросать хоть какие-то силы на его выполнение бессмысленно."
            "{i}Только вот.. Женя.{/i}"
            "Я вздыхаю, недовольная наличием дотошного партнёра, который, как минимум, морально уничтожит меня за невыполненное задание."
            "Взглянув на монитор я увидела, что не слайде парень заботливо расписал что и где именно должно находиться в нашем проекте."
            "{i}В нашем проекте.{/i}"
            "Эта формулировка от подсознания заставляет испытывать вину, от которой я тут же откупаюсь простой мыслью: {i}\"Тогда и ему не следовало уходить, если это парная работа. А может, мне тоже хочется уйти?\"{/i}."
            "Невольно вспоминается время сдачи проектов в школе, и в этот момент ко мне приходит волшебная идея."
            me "Так, где у нас тут браузер.."
            "..."
            "Через несколько минут я получаю готовую презентацию, сгенерированную с помощью нейросети только лишь по одной теме. Осталось загрузить её на компьютер в нашем формате, и эту пару я имею право провести в долгожданном спокойствии."
            "{i}Искусственный интеллект - лучшее изобретение человечества! Психолог, дизайнер и аналитик в одном лице.{/i}"
            "Я перевожу взгляд в угол монитора и, с чувством выполненного долга, откидываюсь на спинку стула: прошло чуть больше пятнадцати минут, так что Женю можно пока не ждать."
            "Вдруг вибрирует в кармане нагретый телефон, который ощущается теперь как маленькая чёрная дыра, способная поглотить остатки моего самообладания." # add sound
            "Пальцы привычно смахивают блокировку экрана, но после не остаётся уверенности.."
            show phone wp at half_size
            "Мои приложения. Мои обои. Но что мне с ними делать? Куда зайти?"
            "Глухая тишина. Ни одного нового уведомления от мамы. Ни одного сообщения в группе с друзьями. Ничего. Вообще."
            "Это кажется физически невозможным: полчаса в сети - это лавина спама, лайков или хотя бы глупых мемов и рекламы в ленте. Но мой экран чист, как свежевыкрашенная стена."
            "{i}Ну давай же.. Сегодня 16 сентября, понедельник{/i}"
            "Я быстро открываю галерею, надеясь увидеть там свои старые фото, что-то, что докажет прямо сейчас: я - это я."
            show phone gallery at half_size
            "Из последних за эти дни: мой кот, заснувший прямо в раковине, селфи в зеркале, скриншоты из игры, какие-то конспекты, написанные отвратительным почерком, совершенно точно моим..."
            "Кажется, это моя жизнь, а я сижу здесь и листаю эти кадры, будто через аквариумное стекло."
            "{i}Здесь. это первое сентября{/i}"
            "Снова мой кот, скриншоты и я в зеркале.. Но когда я начинаю пролистывать ниже, фотографии становятся битыми, а вместо них - бесконечные серые квадраты и восклицательные знаки."
            show phone corrupted_gallery at half_size
            "Моё прошлое буквально стирается, пиксель за пикселем, стоит мне только попытаться в него всмотреться."
            "Сердце стучит так сильно, будто бьётся прямо о ребра и пытается выломать их изнутри."
            "{i}Соберись. по крайней мере здесь тебе ничего не угрожает. Что, если бы ты оказалась не в этом колледже среди студентов, а одна где-нибудь на заброшенной фабрике?{/i}"
            "Обращение к себе помогает вернуть контроль над паникой и заставляет мозг работать на опережение."
            "{i}Что теперь делать? Вариантов у меня не много. Я умерла? Попала в чистилище и должна искупить свои грехи? Бред.{/i}"
            "Я с усилием массирую глаза и прерывисто вздыхаю."
            "{i}Такое чувство, что ничего не изменится, даже если я очень постараюсь..{/i}"
            "Я всё ещё сижу, уставившись в пустые серые квадраты на экране телефона, когда со стороны входа доносится резкий звук открытия двери, а затем кто-то направляется ко мне. Шаги быстрые, уверенные. Уже знакомые."
            "Я судорожно прячу телефон в карман как ученица, пойманная на списывании во время экзамена, чувствуя, как ладони стали ледяными."
            hide phone
            zhenya "Ого, ты превзошла мои ожидания."
            "Голос раздаётся над самым ухом."
            zhenya "Ты сидишь на месте, а аудитория не тонет в розовых блёстках. Это уже успех."
            "Он проходит к столу и, не дожидаясь моей реакции, наклоняется к монитору. В нос бьёт запах его парфюма: кожа, земля после дождя, что-то ещё.. Выверенный, раздражающий своей безупречностью."
            "Женя опирается руками о стол, отняв руку от мышки, внимательно вглядываясь в слайд, который за пару минут наклепала нейросеть."
            "Секунда. Пять. Десять."
            "Воздух вокруг нас будто густеет. Я вижу, как костяшки его пальцев слегка белеют."
            $ rl_reputation -= 1
            $ rl_zhenya -= 1
            show zhenya_m brow at half_size
            zhenya "Это что?"
            "Голос меняется. В нём больше нет привычной иронии. Только сухой, колючий холод."
            me "Это.. Моё видение."
            "Я пытаюсь звучать уверенно, но голос предательски дрожит."
            me "Ты же сам сказал - нужно оформить."
            zhenya "Я сказал оформить, а не превращать проект в записки сумасшедшего."
            "Он выпрямляется и медленно поворачивается ко мне. Его взгляд ощущается как скальпель. В аудитории становится тише.."
            zhenya "Посмотри-ка на этот слайд. «Инновационные векторы диверсификации в условиях рекурсивного абстракционизма»? Это финансовая грамотность, а не манифест по истории искусств."
            me "А что тебе не нравится?"
            "Я поднимаюсь со стула, чувствуя, как внутри закипает злое желание защитить себя."
            me "Красиво же звучит! И графики.."
            "Я осекаюсь, заметив как его губы кривятся от раздражения."
            "Он перелистывает слайды в гробовой тишине. Каждый щелчок мышки - как новый удар по нервам. Весь текст теперь кажется мне набором нелепых иероглифов."
            "{i}Рекурсивный абстракционизм.. Боже мой, о чём я думала?{/i}"
            zhenya "Это не презентация, [np]."
            "Женя наконец отнимает руку от мышки. И немилосердно заканчивает, не глядя на меня."
            zhenya "Это цифровой мусор. Не уверен, что хочу знать ответ, но всё же спрошу. Ты хоть одно слово отсюда прочитала, прежде чем вставлять в наш шаблон?"
            me "Я хотела как лучше, чтоб закончить быстрее! Не думаю, что хоть что-то сделала бы сама, а если бы сделала, ты снова остался бы чем-то недоволен! А ты.."
            "Я чувствую, что говорить этого не стоит, но меня слишком достало его вечное самодовольство."
            me "Ты же просто ушёл! Мне наплевать на этот проект не больше, чем тебе."
            "Он будто окаменел, смотря на экран, где чернели нелепые заголовки, и на мгновение показалось, что он просто проигнорирует мою вспышку."
            "Затем он переводит взгляд на меня. В его глазах нет ярости, только аналитическое разочарование."
            zhenya "Ты правда считаешь, что я ушёл потому, что наплевал на проект и не захотел работать сам? А здесь я оставил человека, которому, как думал, могу доверять."
            "Он делает короткую паузу, и его взгляд скользит по моему лицу, фиксируя каждую эмоцию."
            zhenya "Ошибся. Тебе просто не хватило характера довести до конца хоть что-то, требующее усилий. Это элементарная трусость перед настоящей работой."
            "Он отстраняется, и холод от его присутствия сменяется пустотой. Он снова поворачивается к монитору, доставая телефон и переключая внимание на экран."
            me "Да! Представь себе, меня пугает эта работа. У меня мир из-под ног уходит, в галерее вместо жизни серые дыры, а ты тычешь мне в лицо какими-то терминами! Переделай, если что-то не нравится. Такой как ты прекрасно справится со всем сам."
            "Я отворачиваюсь и решительно шагаю к выходу."
            zhenya "Я не могу сдать проект в таком виде."
            "Он произносит это тихо, скорее сам себе, но я успеваю услышать."
            "Я вылетаю из аудитории, а в ушах всё ещё стоит его голос - тон человека, который снова и снова вынужден исправлять чужие косяки."
            "Заблудившись в проходах я оказываюсь в лёгкой панике, но через пару минут всё же вижу знакомую лестницу вниз и заглядываю в буфет."
            "Выбираю любимый шоколадный батончик и занимаю крайний столик, отодвигая все стулья. Оставляю один для себя."
            "..."
            "Через некоторое время я покидаю столовую и поднимаюсь наверх, в надежде встретить кого-то из группы, кто выведет меня к нужному кабинету. Приходится выждать немного перед тем, как пара заканчивается и все выходят в коридор."
    "Поток одногруппников вывел меня к кабинету на этаж ниже."
    "Войдя я заняла стол в последнем ряду и стала изучать интерьер: на полках большого и массивного, от пола до потолка, стеллажа стояли вплотную друг к другу холсты, явно изрисованные, но рассмотреть отсюда подробнее не удавалось."
    "На соседних полках я заметила макеты фигур, а стены были увешаны работами студентов разного качества."
    "{i}Как в лучших художественных училищах. Эстетика.{/i}"
    "Преподавателя не пришлось ждать долго. Без предисловий отметив нас она вывела на экран презентацию: \"Военно-политические союзы времён 1 мировой войны.\""
    "Прочитав заголовок я скривилась: история в школе мне никогда не нравилась, так что эта пара обещала быть похожей на каторгу.."
    "Одногруппники" "..да она постоянно так делает.."
    "Одногруппники" "Ну, может сегодня не будет."
    "Бурное обсуждение спереди привлекает моё внимание."
    "Одногруппники" "Будет. Ещё и не на 20 вопросов даст, а на 30, так что пиши.."
    "{i}Чёрт, это точно кармическое наказание..{/i}"
    menu:
        "Слушать внимательнее":
            $ rl_specialty += 1
            "Я со вздохом закатываю глаза, но осознаю, что карму нужно искупать, а минусы мне больше не нужны.."
            "Преподователь" "После победы над Германией в 1919 году Верховный совет Антанты практически выполнял функции мирового правительства, занимаясь устроением послевоенного порядка, однако.."
            "Для надёжности я решила фотографировать слайды.."
        "Пропустить мимо ушей":
            $ rl_amoeba += 1
            "Я раздражённо вздохнула, натянув на голову капюшон..."
    show phone sky_reflection at half_size
    "..и вытащила из кармана джинс мобильник. Не успев разблокировать его, зажмурилась: в глаза ударил солнечный свет, видимо, отражённый экраном от окна прямо позади меня."
    "Я обернулась и замерла. За широкими окнами аудитории небо не просто горело, а истекало кровью, золотом и расплавленным янтарём.. И мир за стеклом - серые муравейники, верхушки раскачивающихся деревьев, шпили города - весь он был затоплен этим прощальным, отчаянным светом."
    "Глаза жмурились, слезились от непривычной яркости, но я не могла заставить себя отвернуться. Это было больно, но эта боль была живой. В горле встал ком."
    "Я вдруг с ужасающей ясностью поняла, как давно не видела настоящего неба. Не отфильтрованного экраном, не того, что пробивалось сквозь грязные окна моей комнаты, бесконечно завешанные шторами."
    "Я тосковала по этой умирающей и обновляющийся красоте природы, которую так глупо и безвозвратно пропускала, запертая в стенах своих страхов и чужих ожиданий.."
    "..."
    "Я сидела, по ощущениям, целую вечность, развернувшись к окнам, и уже перестала жмуриться, жадно стараясь запечатлеть то, что вижу, на целую жизнь, а может быть и больше."
    "Меня отвлёк громкий возмущённый шёпот:"
    "???" "Ну я же говорила!"
    "Я с неохотой повернула голову и увидела как преподаватель, чинно вышагивая по аудитории по направлению ко мне, раздавала по листочку на человека."
    "На каждом листе с обеих сторон были пропечатаны вопросы, которых на вид было точно больше чем 20."
    "Я легла на парту, не чувствуя ничего кроме усталости, и прикрыла глаза."
    "Последним, что я запомнила оказалась опустившаяся на стол рука, которая припечатала адский листочек прямо перед моим лицом.."
    jump day2

label day2:
    


